Revit 2026 API

# LevelGetNearestLevelId(Document, Double) Method

---

Returns id of the Level which is closest to the specified elevation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ElementId GetNearestLevelId(
	Document document,
	double elevation
)
```
```vb
Public Shared Function GetNearestLevelId (
	document As Document,
	elevation As Double
) As ElementId
```
```cpp
public:
static ElementId^ GetNearestLevelId(
	Document^ document,
	double elevation
)
```
```fsharp
static member GetNearestLevelId :
        document : Document *
        elevation : float -> ElementId
```

#### Parameters

document Document
     The document.
elevation Double
     Target Elevation.

#### Return Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The level can be at, above or below the target elevation. If there is more than one Level at the same distance from the elevation, the Level with the lowest Id will be returned.

#### Reference

Level Class

GetNearestLevelId Overload

Autodesk.Revit.DB Namespace